In [1]:
import numpy as np
import pandas as pd

## Dados Ausentes

In [2]:
d = {"A":[1, 2, np.nan], "B":[5, np.nan, np.nan], "C":[1, 2, 3]}

In [3]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [4]:
df = pd.DataFrame(d)

In [5]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

##### Eliminar numeros ausentes

In [10]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [11]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [16]:
df.dropna(thresh = 2) ## Só elmina as linhas que têm 2 valores ausentes

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

##### Substituir valores ausentes

In [17]:
df.fillna(value = "Fill Na")

         A        B  C
0        1        5  1
1        2  Fill Na  2
2  Fill Na  Fill Na  3

In [22]:
df["A"].fillna(value = df["A"].mean(), inplace = True)

In [23]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

In [24]:
df.fillna(method = "ffill")

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

## GroupBy

In [30]:
#Criar o DataFrame
data = { "Empresa" : ["GOOG", "GOOG", "MSFT", "MSFT", "FB", "FB"],
        "NOME": ["Sam", "Charlie", "Amy", "Vanessa", "Carl", "Sarah"],
        "Venda": [100, 120, 340, 124, 243, 350]
}

In [37]:
df = pd.DataFrame(data)

In [38]:
group = df.groupby("Empresa")

In [39]:
group.sum()

         Venda
Empresa
FB         593
GOOG       220
MSFT       464

In [40]:
group.mean()

         Venda
Empresa
FB       296.5
GOOG     110.0
MSFT     232.0

In [41]:
group.describe()

        Venda
        count   mean         std    min     25%    50%     75%    max
Empresa
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  110.0   14.142136  100.0  105.00  110.0  115.00  120.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [42]:
group.count()

         NOME  Venda
Empresa
FB          2      2
GOOG        2      2
MSFT        2      2

In [47]:
group = df.groupby("NOME")

In [51]:
group.sum().loc["Amy"]

Venda    340
Name: Amy, dtype: int64